# -*- coding: utf-8 -*-
MSGS = {
    "ascii_hints": '1. 你的人口上限为 200 (每人 100)，可以进入帝王时代。\r\r2. 你可以从市场往牛车里装 1000 黄金，送到古恩佣兵首领 [灰] 那里。他们会奖励你精锐钦察单位，你可以随时拥有 20 个。任何玩家把牛车送到目的地都能拿到奖励，无需全员完成目标。\r\r3. 喀喇契丹可汗 [红] 有一个快速恢复周围军事单位生命值的光环(包括他自己和他的盟友)。他来犯时务必尽快解决他。\r\r4. 本关也可以靠圣物胜利取胜。不过，你得先从敌人手里偷一座圣物。\r\r5. 夺取两座圣物会为你解锁 [信仰] 科技(每名玩家独立生效)。记得侦察地图、赶在敌方僧侣之前找到圣物。\r\r6. 提供所需的资源 (1000 木材、1000 石料和 1000 黄金)，或摧毁喀喇契丹的工场、采矿营和仓库，都可以让建造者们 [橙] 开工修建奇观。\r\r7. 如果你选择奇观胜利，做好防守准备，高难度下尤其如此。奇观建成后，敌人会集中进攻奇观，攻击频率也会大大提高。',
    "ascii_scouts": '你的侦察兵报告：\r\r- 你只带着一小队人马在地图中央开局。你的基地在西面。尽快赶过去发展经济和军队。\r\r- 辽国僧侣 [紫] 在基地东面、隔河相望。他们会用僧侣、长枪兵和投石机进攻你。\r\r- 喀喇契丹 [红] 就在辽国僧侣旁边。他们会放出枪骑兵、轻骑兵、蒙古突骑和投石车组成的大军，并随难度增兵。\r\r- 地图南面边境是古恩佣兵 [灰] 的营地。他们不会直接参战，但只要你付钱，他们就会帮你。\r\r- 传闻有一伙骑手对喀喇契丹恨之入骨。',
}
