# -*- coding: utf-8 -*-
MSGS = {
    "ascii_hints": '1. 你以帝王时代开局，人口上限为 200 (每人 100)。\r\r2. 要夺取这三座贸易工场，只需占领它们旁边可转换的火把。它们每隔几分钟就会给你提供资源。\r4. 如果敌人进攻这些贸易工场而你守不住，先撤退，清掉敌方单位后 再夺回来。否则可能连贸易工场都丢给敌人。另外，若贸易工场被敌人夺走，你的部队可能会被困在有围墙的基地里。\r5. 解放达布西亚 [红] 后，这座城镇会定期提供一些资源。\r6. 摧毁三座堡楼，土库曼人 [橙] 会为你提供相当好用的骑射手。',
    "ascii_scouts": '你的侦察兵报告：\r\r- 你在地图东北面开局，手头没有村民。可以在达布西亚 [红] 找到一些，但这座城被伽色尼军队团团围住。\r\r- 伽色尼 [绿] 在河对岸拥有大量定居点和基地。他们有种类繁多的部队自卫，比如轻骑兵、骑射手、古拉姆等等，还会根据你的兵种构成来出兵。\r\r- 阿尔通塔什 [黄] 在地图中央扎营，凭借悬崖、箭塔和城堡设防。他会用重装骑兵、战象、弩手和投石机进攻你。\r\r- 伽色尼主力大军 [紫] 刚刚抵达，在南面和西面建立了营地。他们训练粟特重装骑兵和骑射手。\r\r- 有三处能产出资源的贸易工场：一处在达布西亚，一处在东/东南面的伽色尼基地，还有一处在西面的伽色尼基地。',
}
