# -*- coding: utf-8 -*-
MSGS = {
    "ascii_hints": '1. 在这类挑战中，你必须先派轻骑侦察，再投入主力。你的轻骑兵视野很大，但这样可能会在东面山区发现被围墙和敌军困住的俘虏。这种情况下，建议改用骑射手侦察，他们的视野同样开阔。\r2. 避免与占据高地的敌人交战。\r3. 骑射手极擅游走战术。\r4. 摧毁回鹘和突骑施的铁匠铺可以获得一些科技。\r5. 保持警惕，直到最后一刻。\r6. 友军 [灰] 可以通过派单位靠近来收编。谁先靠近就归谁。如果你们中某位玩家兵力吃紧，请记住这一点。',
    "ascii_scouts": '你的侦察兵报告：\r- 你从地图南面出发，目标是远在北方的葛逻禄营地 [灰]。你需要保住可汗、两辆大车，且每人至少 10 个军事单位存活。\r- 有两条路可达目的地：东面的山道(右)，或西面的悬崖(左)。\r- 若走东面山区，将遭遇盯上你们的回鹘侦察队 [绿]，他们由重骆驼兵、答剌罕、草原枪骑兵、重装骑射手和少量攻城武器组成。这条路丘陵众多，可以利用塔塔尔的丘陵加成。\r- 西面悬崖上驻守着突骑施 [红]。他们以怯薛、重装骑射手、草原枪骑兵、掷矛手、长枪兵和攻城武器把守这条路。这条路几乎没有丘陵。\r- 地图中央你会发现钦察人 [黄]。他们建立了有经济体系的基地，会用重装骑兵、草原枪骑兵和钦察守卫。如果你们用怯薛去袭扰他们，见他们大军压上就赶紧撤。他们有补充兵力的手段。困难难度及以上，他们还会对你发动小规模进攻。务必当心！\r- 东西两面各处散居着一些当地部族。他们或许会有所馈赠。',
}
