# -*- coding: utf-8 -*-
MSGS = {
    "ascii_hints": '1. 你的人口上限为 200 (每人 100)，可以进入帝王时代(注意：这场大战发生在火药发明之前几个世纪)。\r\r2. 你离阿拔斯人更近，所以挨打最狠的会是你。你的中国盟友推进缓慢，但后劲十足。\r\r3. 要完成叛投，你可以在阿拔斯 [绿] 堡垒对岸的河边建一座城镇中心或城堡，或派超过 10 个军事单位进入唐朝 [黄] 堡垒，又或者干脆没能按时完成消灭阿拔斯单位的次要目标。\r\r4. 你的开局位置资源不算丰富。所以叛投之前，可以先沿河及更远处采集资源、发展经济。\r\r5. 唐朝主打阿拔斯，而拔汗那在你改换门庭后会与你反复交手。他们的可汗有强力的治疗光环，他一露面就尽快解决他！\r\r6. 与阿拔斯结盟后，你会得到一些资源、村民和科技。\r\r7. 进入帝王时代后，你可以建造商队旅馆来提升贸易。\r\r8. [合作] 困难难度起，你们会不定期接到限时消灭阿拔斯单位的可重复次要目标。完成它能为你争取备战的额外时间，也能平息唐朝与拔汗那对葛逻禄人的疑心。两名玩家的击杀共同计入。',
    "ascii_scouts": '你的侦察兵报告：\r- 你在怛罗斯河的东岸。你的目标是叛投阿拔斯王朝 [绿]，并最终击败唐朝 [黄] 及其盟友。\r- 你目前的敌人是阿拔斯哈里发国 [绿]。阿拔斯人训练骆驼兵、古拉姆、标枪骑兵和投石机。\r- 就在你旁边的是中国人 [黄]。他们会用诸葛弩兵、火枪兵、骑兵和投石机进攻阿拔斯人。\r- 地图东南面是拔汗那 [紫]。这些突厥部落会放出轻骑兵、草原枪骑兵、骑射手和少量投石机。你完成叛投后，他们会训练更多单位。\r- 阿拔斯人南面有一大片空地，如有需要，你可以在那里建设基地。',
}
