# -*- coding: utf-8 -*-
MSGS = {
    "ascii_hints": '1. 你的人口上限为 200 (每人 100)，且无法进入帝王时代。\r\r2. 这张地图有大量牲畜和可猎杀的动物。趁近处的猎物耗尽之前，尽量先取远处基地的猎物——至少开局 15 分钟内你不会受到威胁。\r\r3. 地形多丘陵与悬崖，善加利用塔塔尔的丘陵加成。\r\r4. 集齐四座圣物可让你的单位缓慢恢复生命值(圣物由两名玩家共享计数，不必担心分配问题)。\r\r5. 随时可以输入 "31" 命令回鹘 [绿] 进攻。不过他们单位不足时可能会拒绝。\r\r6. 你的可汗光环同样作用于盟友单位。搭配使用，效果更佳。',
    "ascii_scouts": '你的侦察兵报告：\r\r- 葛逻禄 [P1, 蓝] 从地图南面开局，只有几名村民和军事单位，目标是推翻这片土地上的突厥统治。\r\r- 拔悉密 [P2, 青] 位于葛逻禄营地旁，同样以少量军事单位和村民开局。\r\r- 回鹘 [绿] 的基地在拔悉密的东北面。他们会训练轻骑兵和答剌罕。\r\r- 突厥 [红] 的都城在你们营地的西北面。他们会用复合弓兵、轻骑兵、骑射手、骆驼兵和投石机攻击最强的那位玩家。\r\r- 突厥定居点 [紫] 散布在地图各处，为他们的主子提供资源。他们不训练军事单位，袭击起来会很容易。仓库给你食物，贸易工场给你木材、黄金和食物。\r\r- 地图最东面的边境有一座中国前哨，由唐朝 [黄] 统领。他们不会参战，但那里有一个市场。',
}
