# -*- coding: utf-8 -*-
MSGS = {
    "ascii_hints": "1. 皮洛士与他的伊庇鲁斯盟友们正准备入侵希腊，人口上限为 350 人。\r\r2. 本关背景为古典时代，你与敌人的所有火药单位均被禁用。\r\r3. 由于皮洛士尚未接触过熟练的工匠，整关双方都没有巨型投石机。为弥补这一缺憾，皮洛士的攻城战象系统与伊庇鲁斯的冲锋车系统更加灵敏(碰撞体积更小)。\r\r4. 合理分配你的人口，敌人拥有一支强大的海军力量！\r\r5. 尽快击败尼奥普托勒摩斯，你的敌人不会等你太久！\r\r6. 德米特里会在合适的时机主动加入战场，但提早击败他将大幅强化你的攻城单位！\r\r7. 尽量保住海边的希腊教堂不倒。一旦倒塌，你的人口空间将被大幅削减！",
    "ascii_scouts": "侦察报告：\r\r- 皮洛士 (P1, 绿) 与他的伊庇鲁斯盟友 (P2, 橙) 即将入侵希腊，他们首先要攻取的是尼奥普托勒摩斯的城市 (P3, 红)。\r\r- 在伯尼本扎半岛上，还有几支主要势力：亚历山大五世 (P4, 黄)、安提帕特 (P5, 蓝)、吕西马科斯 (P7, 青)。他们虽然彼此不和，却在皮洛士的入侵面前暂时联合了起来。\r\r- 几个主要敌人会派出各自的独特单位、重骑士、强力弩手和大批海军，进攻皮洛士刚刚夺取的基地。\r\r- 皮洛士的主要敌人——德米特里 (P6, 紫) 正从东方逼近。他们来势汹汹，将派出冲锋战车和贵族骑兵发起进攻。",
}
